---------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\dstone\Dropbox\who_how\scripts\survey\all_pooled.log
  log type:  text
 opened on:  13 Apr 2016, 07:46:04

. 
. 
. use "C:\Users\dstone\Dropbox\who_how\data\survey\cleansurvey.dta", clear

. 
. 
. 
. ren recall_order order

. 
. gen outParty = 0

. replace outP = 1 if Dem==1 & recall_par=="rep"
(474 real changes made)

. replace outP = 1 if Dem==0 & recall_par=="dem"
(392 real changes made)

. 
. gen orderOut = order*out

. 
. gen extreme = -recall_rating if recall_par=="dem"
(830 missing values generated)

. replace extreme = recall_rat if recall_par=="rep"
(820 real changes made)

. 
. gen extreme2 = cfscore

. replace extreme2 = -cfscore if recall_par=="dem"
(900 real changes made)

. 
. gen extreme2b = cfscoresdyn

. replace extreme2b = - cfscoresdyn if recall_par=="dem"
(900 real changes made)

. 
. 
. gen Rpol = (recall_par=="rep")

. 
. pca extreme2* 

Principal components/correlation                  Number of obs    =      1725
                                                  Number of comp.  =         2
                                                  Trace            =         2
    Rotation: (unrotated = principal)             Rho              =    1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      1.89242      1.78483             0.9462       0.9462
           Comp2 |      .107585            .             0.0538       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    ------------------------------------------------
        Variable |    Comp1     Comp2 | Unexplained 
    -------------+--------------------+-------------
        extreme2 |   0.7071    0.7071 |           0 
       extreme2b |   0.7071   -0.7071 |           0 
    ------------------------------------------------

. predict extpca
(score assumed)
(1 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ----------------------------------
        Variable |    Comp1     Comp2 
    -------------+--------------------
        extreme2 |   0.7071           
       extreme2b |   0.7071   -0.7071 
    ----------------------------------

. 
. egen id = group(uniqid)

. 
. xtset id
       panel variable:  id (unbalanced)

. 
. xi: qui reg extreme outParty order  Rpol, robust cluster(id)

. est store a

. xi: qui reg extreme outParty order orderOut  Rpol, robust cluster(id)

. est store b

. 
. xi: qui reg extreme outParty order  i.name  Rpol, robust cluster(id)
i.name            _Iname_1-30         (_Iname_1 for name==al gore omitted)

. est store c

. xi: qui reg extreme outParty order orderOut i.name  Rpol, robust cluster(id)
i.name            _Iname_1-30         (_Iname_1 for name==al gore omitted)

. est store d

. 
. xi: qui reg extreme outParty order  i.name i.educ i.age Whi Rpol, robust cluster(id)
i.name            _Iname_1-30         (_Iname_1 for name==al gore omitted)
i.educ            _Ieduc_1-4          (_Ieduc_1 for educ==Advanced degree omitted)
i.age             _Iage_1-3           (_Iage_1 for age==18-29 omitted)

. est store e

. xi: qui reg extreme outParty order orderOut i.name i.educ i.age Whi  Rpol, robust cluster(id)
i.name            _Iname_1-30         (_Iname_1 for name==al gore omitted)
i.educ            _Ieduc_1-4          (_Ieduc_1 for educ==Advanced degree omitted)
i.age             _Iage_1-3           (_Iage_1 for age==18-29 omitted)

. est store f

. 
. xi: qui reg extreme outParty order  i.name i.educ i.ideo i.age Whi  Rpol, robust cluster(id)
i.name            _Iname_1-30         (_Iname_1 for name==al gore omitted)
i.educ            _Ieduc_1-4          (_Ieduc_1 for educ==Advanced degree omitted)
i.ideo            _Iideo_1-4          (_Iideo_1 for ideo==Conservative omitted)
i.age             _Iage_1-3           (_Iage_1 for age==18-29 omitted)

. est store g

. xi: qui reg extreme outParty order orderOut i.name i.educ i.ideo i.age Whi  Rpol, robust cluster(id)
i.name            _Iname_1-30         (_Iname_1 for name==al gore omitted)
i.educ            _Ieduc_1-4          (_Ieduc_1 for educ==Advanced degree omitted)
i.ideo            _Iideo_1-4          (_Iideo_1 for ideo==Conservative omitted)
i.age             _Iage_1-3           (_Iage_1 for age==18-29 omitted)

. est store h

. 
. estout a b c d e f g h, keep ( outParty order orderOut ) style(tex) cells(b(star fmt(3)) se(par)) stats(r2_a N, fmt(%9.3f %9.0g)) starlevels(* 0.10 ** 
> 0.05 *** 0.01)

            &           a   &           b   &           c   &           d   &           e   &           f   &           g   &           h   \\
            &        b/se   &        b/se   &        b/se   &        b/se   &        b/se   &        b/se   &        b/se   &        b/se   \\
outParty    &       0.433***&       0.686***&       0.414***&       0.698***&       0.416***&       0.704***&       0.426***&       0.716***\\
            &     (0.066)   &     (0.109)   &     (0.066)   &     (0.112)   &     (0.066)   &     (0.111)   &     (0.065)   &     (0.110)   \\
order       &      -0.098***&      -0.033   &      -0.114***&      -0.039   &      -0.117***&      -0.041   &      -0.115***&      -0.039   \\
            &     (0.026)   &     (0.035)   &     (0.033)   &     (0.042)   &     (0.033)   &     (0.042)   &     (0.032)   &     (0.042)   \\
orderOut    &               &      -0.130** &               &      -0.147***&               &      -0.149***&               &      -0.150***\\
            &               &     (0.051)   &               &     (0.053)   &               &     (0.052)   &               &     (0.052)   \\
r2_a        &       0.934   &       0.934   &       0.936   &       0.936   &       0.936   &       0.936   &       0.937   &       0.937   \\
N           &        1715   &        1715   &        1715   &        1715   &        1715   &        1715   &        1715   &        1715   \\

. 
. 
end of do-file

. do "C:\Users\dstone\AppData\Local\Temp\STD0k000000.tmp"

. cd "C:\Users\dstone\Dropbox\who_how\scripts\survey\"
C:\Users\dstone\Dropbox\who_how\scripts\survey

. 
. cap log close
